class text(object):
  START = """{},

𝖳𝗁𝗂𝗌 𝖻𝗈𝗍 𝗆𝖺𝗒 𝖼𝗈𝗇𝗍𝖺𝗂𝗇 𝖼𝗈𝗇𝗍𝖾𝗇𝗍 𝗂𝗇𝗍𝖾𝗇𝖽𝖾𝖽 𝖿𝗈𝗋 𝖺𝖽𝗎𝗅𝗍𝗌 (𝟣𝟪+).

𝖯𝗅𝖾𝖺𝗌𝖾 𝗉𝗋𝗈𝖼𝖾𝖾𝖽 𝖺𝗍 𝗒𝗈𝗎𝗋 𝗈𝗐𝗇 𝗋𝗂𝗌𝗄.

𝖲𝗈𝗆𝖾 𝗆𝖺𝗍𝖾𝗋𝗂𝖺𝗅 𝗆𝖺𝗒 𝗂𝗇𝖼𝗅𝗎𝖽𝖾 𝖾𝗑𝗉𝗅𝗂𝖼𝗂𝗍 𝗈𝗋 𝗀𝗋𝖺𝗉𝗁𝗂𝖼 𝖼𝗈𝗇𝗍𝖾𝗇𝗍 𝗍𝗁𝖺𝗍 𝗂𝗌 𝗇𝗈𝗍 𝗌𝗎𝗂𝗍𝖺𝖻𝗅𝖾 𝖿𝗈𝗋 𝗆𝗂𝗇𝗈𝗋𝗌."""

  LOG = """👁️‍🗨️ 𝘜𝘚𝘌𝘙 𝘋𝘌𝘛𝘈𝘐𝘓𝘚

○ 𝘐𝘋 : <code>{}</code>
○ 𝘋𝘊 : {}
○ 𝘍𝘪𝘳𝘴𝘵 𝘕𝘢𝘮𝘦 : {}
○ 𝘜𝘴𝘦𝘳𝘕𝘢𝘮𝘦 : {}

𝘉𝘺 = @{}"""

  ABOUT = """⚠️ This bot is for adults (18+) only. All content is publicly available on the internet. Admin does not host any files and is not responsible for user actions. Use at your own responsibility. Contact admin for any issues.\n\n If you want to remove any content from bot. contect to admin with Post Id."""
  
  PRO = """<b><u>🆓 𝖥𝗋𝖾𝖾 𝖯𝗅𝖺𝗇</u></b>

» Under free plan, each day you will get free <b>{free_limit}</b> files per day.    
» Completely free — no payment required.
» If you want to unlock more content and enjoy a smoother experience, consider upgrading to a premium plan:

<b><u>💎 𝖯𝗋𝖾𝗆𝗂𝗎𝗆 𝖯𝗅𝖺𝗇𝗌</u></b>

<b>🥈 𝖲𝗂𝗅𝗏𝖾𝗋 𝖯𝗅𝖺𝗇</b>  
» <b>1 Week</b> — 25 INR  

<b>🥇 𝖦𝗈𝗅𝖽 𝖯𝗅𝖺𝗇</b>  
» <b>20 Days</b> — 40 INR  

<b>💠 𝖣𝗂𝖺𝗆𝗈𝗇𝖽 𝖯𝗅𝖺𝗇</b>  
» <b>1 Month</b> — 60 INR  

✨ ᴜᴘɪ ɪᴅ - <code>navex69@axl</code>
💢 ᴍᴜsᴛ sᴇɴᴅ sᴄʀᴇᴇɴsʜᴏᴛ ᴀꜰᴛᴇʀ ᴘᴀʏᴍᴇɴᴛ
‼️ ᴀꜰᴛᴇʀ sᴇɴᴅɪɴɢ ᴀ sᴄʀᴇᴇɴsʜᴏᴛ ᴘʟᴇᴀsᴇ ɢɪᴠᴇ ᴍᴇ sᴏᴍᴇ ᴛɪᴍᴇ ᴛᴏ ᴀᴅᴅ ʏᴏᴜ ɪɴ ᴛʜᴇ ᴘʀᴇᴍɪᴜᴍ ᴠᴇʀsɪᴏɴ.

<blockquote>
<b>Note:</b> Once a plan is selected, it cannot be changed.  
All payments are <b>non-refundable</b>, so please review your choice carefully before proceeding.</blockquote>"""

  ADMIN_COMMANDS = """<b><u>⭐ Admin Commands</u>
                                      
» /setlimit — Update the daily usage limit for free users.

» /resetlimits — Reset the daily count to 0 for all free users.

» /index — Manually index videos from database channels.

» /maintenance — Toggle maintenance mode ON or OFF.

» /prime — Add a user to the Prime membership.

» /remove — Remove a user from Prime membership.

» /deleteall — Delete all videos from the database.

» /delete — Delete a specific video using its Telegram message ID.

» /broadcast — Send a message broadcast to all users.

» /ban — Ban a specific user.

» /unban — Unban a specific user.

» /banlist — To check banned Users.

» /stats — View detailed bot statistics.

» /l — Start generating a shareable link for files.

» /m_link — Generate link after collecting files.</b>"""
  
  HELP = """<b>𝖡𝗈𝗍 𝖣𝗂𝗌𝖼𝗅𝖺𝗂𝗆𝖾𝗋 & 𝖴𝗌𝖺𝗀𝖾 𝖦𝗎𝗂𝖽𝖾:</b>

𝖳𝗁𝗂𝗌 𝖻𝗈𝗍 𝗂𝗌 𝗌𝗉𝖾𝖼𝗂𝖺𝗅𝗅𝗒 𝖽𝖾𝗌𝗂𝗀𝗇𝖾𝖽 𝖿𝗈𝗋 𝖺𝖽𝗎𝗅𝗍 𝗎𝗌𝖾𝗋𝗌 (𝟣𝟪+) 𝖺𝗇𝖽 𝖾𝗇𝖺𝖻𝗅𝖾𝗌 𝖾𝖺𝗌𝗒 𝖺𝖼𝖼𝖾𝗌𝗌 𝗍𝗈 𝖼𝗈𝗇𝗍𝖾𝗇𝗍 𝗏𝗂𝖺 𝗌𝗂𝗆𝗉𝗅𝖾 𝖼𝗈𝗆𝗆𝖺𝗇𝖽𝗌.

» /getvideos 𝗍𝗈 𝗋𝖾𝗊𝗎𝖾𝗌𝗍 𝖺 𝖺𝖽𝗎𝗅𝗍 𝗏𝗂𝖽𝖾𝗈
» /myplan 𝗍𝗈 𝖼𝗁𝖾𝖼𝗄 𝗒𝗈𝗎𝗋 𝖽𝖺𝗂𝗅𝗒 𝗅𝗂𝗆𝗂𝗍 𝖺𝗇𝖽 𝗌𝗎𝖻𝗌𝖼𝗋𝗂𝗉𝗍𝗂𝗈𝗇 𝖽𝖾𝗍𝖺𝗂𝗅𝗌

𝖠𝗅𝗈𝗇𝗀 𝗐𝗂𝗍𝗁 𝗍𝗁𝖾 𝖿𝗋𝖾𝖾 𝗉𝗅𝖺𝗇, 𝗐𝖾 𝗈𝖿𝖿𝖾𝗋 𝗉𝗋𝖾𝗆𝗂𝗎𝗆 𝗉𝗅𝖺𝗇𝗌:
» 𝖲𝗂𝗅𝗏𝖾𝗋
» 𝖦𝗈𝗅𝖽
» 𝖣𝗂𝖺𝗆𝗈𝗇𝖽

𝖳𝗁𝖾𝗌𝖾 𝗉𝗅𝖺𝗇𝗌 𝗉𝗋𝗈𝗏𝗂𝖽𝖾 𝗁𝗂𝗀𝗁𝖾𝗋 𝗎𝗌𝖺𝗀𝖾 𝗅𝗂𝗆𝗂𝗍𝗌, 𝖿𝖺𝗌𝗍𝖾𝗋 𝖺𝖼𝖼𝖾𝗌𝗌, 𝖺𝗇𝖽 𝖺𝖽𝗏𝖺𝗇𝖼𝖾𝖽 𝖿𝖾𝖺𝗍𝗎𝗋𝖾𝗌 𝖿𝗈𝗋 𝖺 𝗌𝗆𝗈𝗈𝗍𝗁𝖾𝗋 𝖾𝗑𝗉𝖾𝗋𝗂𝖾𝗇𝖼𝖾.

<b><blockquote>𝖭𝗈𝗍𝖾: 𝖳𝗁𝗂𝗌 𝖻𝗈𝗍 𝗂𝗌 𝗌𝗍𝗋𝗂𝖼𝗍𝗅𝗒 𝗂𝗇𝗍𝖾𝗇𝖽𝖾𝖽 𝖿𝗈𝗋 𝖺𝖽𝗎𝗅𝗍𝗌 (𝟣𝟪+). 𝖴𝗌𝖾 𝗂𝗍 𝖺𝗍 𝗒𝗈𝗎𝗋 𝗈𝗐𝗇 𝗋𝗂𝗌𝗄.</blockquote></b>"""

  # Verification Messages
  VERIFICATION_TEXT = """<b>👋 ʜᴇʏ {}, {}

📝 ʏᴏᴜ ᴀʀᴇ ɴᴏᴛ ᴠᴇʀɪғɪᴇᴅ ᴛᴏᴅᴀʏ !
      
🔐 ᴄʟɪᴄᴋ ᴛʜᴇ ʙᴜᴛᴛᴏɴ ʙᴇʟᴏᴡ ᴛᴏ ᴠᴇʀɪғʏ

⏰ ᴛʜɪs ᴠᴇʀɪғɪᴄᴀᴛɪᴏɴ ᴡɪʟʟ ʙᴇ ᴠᴀʟɪᴅ ᴜɴᴛɪʟ: {}</b>"""

  SECOND_VERIFICATION_TEXT = """<b>👋 ʜᴇʏ {}, {}

📝 ʏᴏᴜʀ ғɪʀsᴛ ᴠᴇʀɪғɪᴄᴀᴛɪᴏɴ ʜᴀs ᴇxᴘɪʀᴇᴅ !
      
🔐 ᴄʟɪᴄᴋ ᴛʜᴇ ʙᴜᴛᴛᴏɴ ʙᴇʟᴏᴡ ᴛᴏ ᴄᴏᴍᴘʟᴇᴛᴇ sᴇᴄᴏɴᴅ ᴠᴇʀɪғɪᴄᴀᴛɪᴏɴ

⏰ ᴛʜɪs ᴠᴇʀɪғɪᴄᴀᴛɪᴏɴ ᴡɪʟʟ ʙᴇ ᴠᴀʟɪᴅ ᴜɴᴛɪʟ: {}</b>"""

  THIRDT_VERIFICATION_TEXT = """<b>👋 ʜᴇʏ {}, {}

📝 ʏᴏᴜʀ sᴇᴄᴏɴᴅ ᴠᴇʀɪғɪᴄᴀᴛɪᴏɴ ʜᴀs ᴇxᴘɪʀᴇᴅ !
      
🔐 ᴄʟɪᴄᴋ ᴛʜᴇ ʙᴜᴛᴛᴏɴ ʙᴇʟᴏᴡ ᴛᴏ ᴄᴏᴍᴘʟᴇᴛᴇ ᴛʜɪʀᴅ ᴠᴇʀɪғɪᴄᴀᴛɪᴏɴ

⏰ ᴛʜɪs ᴠᴇʀɪғɪᴄᴀᴛɪᴏɴ ᴡɪʟʟ ʙᴇ ᴠᴀʟɪᴅ ᴜɴᴛɪʟ: {}</b>"""

  VERIFY_COMPLETE_TEXT = """<b>✅ ᴄᴏɴɢʀᴀᴛᴜʟᴀᴛɪᴏɴs {}, 

ʏᴏᴜ ʜᴀᴠᴇ sᴜᴄᴄᴇssғᴜʟʟʏ ᴄᴏᴍᴘʟᴇᴛᴇᴅ ғɪʀsᴛ ᴠᴇʀɪғɪᴄᴀᴛɪᴏɴ ✅

ɴᴏᴡ ʏᴏᴜ ᴄᴀɴ ᴀᴄᴄᴇss ᴜɴʟɪᴍɪᴛᴇᴅ ᴠɪᴅᴇᴏs ᴜɴᴛɪʟ: {}

🎉 ᴇɴᴊᴏʏ ʏᴏᴜʀ ᴜɴʟɪᴍɪᴛᴇᴅ ᴀᴄᴄᴇss!</b>"""

  SECOND_VERIFY_COMPLETE_TEXT = """<b>✅ ᴄᴏɴɢʀᴀᴛᴜʟᴀᴛɪᴏɴs {}, 

ʏᴏᴜ ʜᴀᴠᴇ sᴜᴄᴄᴇssғᴜʟʟʏ ᴄᴏᴍᴘʟᴇᴛᴇᴅ sᴇᴄᴏɴᴅ ᴠᴇʀɪғɪᴄᴀᴛɪᴏɴ ✅

ɴᴏᴡ ʏᴏᴜ ᴄᴀɴ ᴀᴄᴄᴇss ᴜɴʟɪᴍɪᴛᴇᴅ ᴠɪᴅᴇᴏs ᴜɴᴛɪʟ: {}

🎉 ᴇɴᴊᴏʏ ʏᴏᴜʀ ᴜɴʟɪᴍɪᴛᴇᴅ ᴀᴄᴄᴇss!</b>"""

  THIRDT_VERIFY_COMPLETE_TEXT = """<b>✅ ᴄᴏɴɢʀᴀᴛᴜʟᴀᴛɪᴏɴs {}, 

ʏᴏᴜ ʜᴀᴠᴇ sᴜᴄᴄᴇssғᴜʟʟʏ ᴄᴏᴍᴘʟᴇᴛᴇᴅ ᴛʜɪʀᴅ ᴠᴇʀɪғɪᴄᴀᴛɪᴏɴ ✅

ɴᴏᴡ ʏᴏᴜ ᴄᴀɴ ᴀᴄᴄᴇss ᴜɴʟɪᴍɪᴛᴇᴅ ᴠɪᴅᴇᴏs ᴜɴᴛɪʟ: {}

🎉 ᴇɴᴊᴏʏ ʏᴏᴜʀ ᴜɴʟɪᴍɪᴛᴇᴅ ᴀᴄᴄᴇss!</b>"""

  VERIFIED_LOG_TEXT = """#Verified

<b>User Details:
• Name: {}
• ID: <code>{}</code>
• Date: {}
• Verification: #{}</b>"""
